<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  
  <title>JVM实用参数（七）CMS收集器 | DeleiGuo</title>
  <meta name="author" content="DeleiGuo">
  
  <meta name="description" content="Target、Focus、Patient">
  
  
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

  <meta property="og:title" content="JVM实用参数（七）CMS收集器"/>
  <meta property="og:site_name" content="DeleiGuo"/>

  
    <meta property="og:image" content="undefined"/>
  

  <link href="/favicon.png" rel="icon">
  <link rel="alternate" href="/atom.xml" title="DeleiGuo" type="application/atom+xml">
  <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">
  <link rel="stylesheet" href="/plugins/font-awesome-4.7.0/css/font-awesome.min.css">
  <link rel="stylesheet" href="/plugins/highlight/styles/github.css">
  <link rel="stylesheet" href="//cdn.bootcss.com/animate.css/3.5.2/animate.min.css">
  <link rel="stylesheet" href="/plugins/bootstrap-3.3.0/css/bootstrap.min.css">
  <!--[if lt IE 9]><script src="//cdn.bootcss.com/html5shiv/3.7.3/html5shiv.min.js"></script><![endif]-->

</head>


<body>
  <header id="header" class="">
        <div class="container">
          <a class="home-link" href="/">
  <h1 class="site-title animated zoomIn">DeleiGuo</h1>
  <h2 class="site-title-description animated zoomInLeft">Target、Focus、Patient</h2>
</a>
<div class="clearfix"></div>

        </div>
  </header>
  <nav id="main-nav" class="navbar navbar-default">
    <div class="container">
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#ddnavbar">
              <span class="sr-only">Toggle navigation</span>
              <span class="icon-bar"></span>
              <span class="icon-bar"></span>
              <span class="icon-bar"></span>
            </button>
          </div>
          <div id="ddnavbar" class="navbar-collapse collapse">
            <ul class="nav navbar-nav">
              
                <li><a href="/"><i class="fa fa-home">&nbsp;</i>首页</a></li>
              
                <li><a href="/archives"><i class="fa fa-archive">&nbsp;</i>归档</a></li>
              
                <li><a href="/books"><i class="fa fa-book">&nbsp;</i>书籍库</a></li>
              
                <li><a href="/about"><i class="fa fa-user">&nbsp;</i>关于</a></li>
              
            </ul>
          </div>
    </div>
    <div class="clearfix"></div>
  </nav>
  <div id="content">
    <div id="main-col" class="alignleft"><div id="wrapper"><article class="post">
  
  <div class="post-content">
    <header>
      
        <div class="icon"></div>
        <time datetime="2016-10-08T11:19:56.000Z"><a href="/2016/10/08/useful-jvm-flags-part-7-cms-collector/">2016-10-08</a></time>
      
      
  
    <h1 class="title">JVM实用参数（七）CMS收集器</h1>
  

    </header>
    <div class="entry">
      
        <blockquote>
<p>&#x8F6C;&#x8F7D;&#x81EA;&#x5E76;&#x53D1;&#x7F16;&#x7A0B;&#x7F51; &#x2013; ifeve.com&#x672C;&#x6587;&#x94FE;&#x63A5;&#x5730;&#x5740;: <a href="http://ifeve.com/useful-jvm-flags-part-7-cms-collector/" target="_blank" rel="external">JVM&#x5B9E;&#x7528;&#x53C2;&#x6570;&#xFF08;&#x4E03;&#xFF09;CMS&#x6536;&#x96C6;&#x5668;</a><br>&#x672C;&#x6587;&#x662F;<a href="http://ifeve.com" target="_blank" rel="external">&#x5E76;&#x53D1;&#x7F16;&#x7A0B;&#x7F51;</a>&#x7ECF;&#x539F;&#x56FD;&#x5916;blog&#x4F5C;&#x8005;&#x6388;&#x6743;&#x7684;&#x4E2D;&#x6587;&#x8BD1;&#x6587;</p>
</blockquote>
<p><strong>&#x8BD1;&#x8005;:</strong> iDestiny<br><strong>&#x6821;&#x5BF9;:</strong> &#x6881;&#x6D77;&#x8230;</p>
<p>HotSpot JVM&#x7684;&#x5E76;&#x53D1;&#x6807;&#x8BB0;&#x6E05;&#x7406;&#x6536;&#x96C6;&#x5668;(CMS&#x6536;&#x96C6;&#x5668;)&#x7684;&#x4E3B;&#x8981;&#x76EE;&#x6807;&#x5C31;&#x662F;:&#x4F4E;&#x5E94;&#x7528;&#x505C;&#x987F;&#x65F6;&#x95F4;&#x3002;&#x8BE5;&#x76EE;&#x6807;&#x5BF9;&#x4E8E;&#x5927;&#x591A;&#x6570;&#x4EA4;&#x4E92;&#x5F0F;&#x5E94;&#x7528;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x6BD4;&#x5982;web&#x5E94;&#x7528;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x770B;&#x4E00;&#x4E0B;&#x6709;&#x5173;JVM&#x7684;&#x53C2;&#x6570;&#x4E4B;&#x524D;,&#x8BA9;&#x6211;&#x4EEC;&#x7B80;&#x8981;&#x56DE;&#x987E;CMS&#x6536;&#x96C6;&#x5668;&#x7684;&#x64CD;&#x4F5C;&#x548C;&#x4F7F;&#x7528;&#x5B83;&#x65F6;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x7684;&#x4E3B;&#x8981;&#x6311;&#x6218;&#x3002;</p>
<p>&#x5C31;&#x50CF;&#x541E;&#x5410;&#x91CF;&#x6536;&#x96C6;&#x5668;(&#x53C2;&#x89C1;&#x672C;&#x7CFB;&#x5217;&#x7684;&#x7B2C;6&#x90E8;&#x5206;),CMS&#x6536;&#x96C6;&#x5668;&#x5904;&#x7406;&#x8001;&#x5E74;&#x4EE3;&#x7684;&#x5BF9;&#x8C61;,&#x7136;&#x800C;&#x5176;&#x64CD;&#x4F5C;&#x8981;&#x590D;&#x6742;&#x5F97;&#x591A;&#x3002;&#x541E;&#x5410;&#x91CF;&#x6536;&#x96C6;&#x5668;&#x603B;&#x662F;&#x6682;&#x505C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EBF;&#x7A0B;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x80FD;&#x662F;&#x76F8;&#x5F53;&#x957F;&#x7684;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x7136;&#x800C;&#x8FD9;&#x80FD;&#x591F;&#x4F7F;&#x8BE5;&#x7B97;&#x6CD5;&#x5B89;&#x5168;&#x5730;&#x5FFD;&#x7565;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;CMS&#x6536;&#x96C6;&#x5668;&#x88AB;&#x8BBE;&#x8BA1;&#x6210;&#x5728;&#x5927;&#x591A;&#x6570;&#x65F6;&#x95F4;&#x80FD;&#x4E0E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EBF;&#x7A0B;&#x5E76;&#x884C;&#x6267;&#x884C;&#xFF0C;&#x4EC5;&#x4EC5;&#x4F1A;&#x6709;&#x4E00;&#x70B9;(&#x77ED;&#x6682;&#x7684;)&#x505C;&#x987F;&#x65F6;&#x95F4;&#x3002;GC&#x4E0E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5E76;&#x884C;&#x7684;&#x7F3A;&#x70B9;&#x5C31;&#x662F;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x5404;&#x79CD;&#x540C;&#x6B65;&#x548C;&#x6570;&#x636E;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x5B89;&#x5168;&#x4E14;&#x6B63;&#x786E;&#x7684;&#x5E76;&#x53D1;&#x6267;&#x884C;&#xFF0C;CMS&#x6536;&#x96C6;&#x5668;&#x7684;GC&#x5468;&#x671F;&#x88AB;&#x5206;&#x4E3A;&#x4E86;&#x597D;&#x51E0;&#x4E2A;&#x8FDE;&#x7EED;&#x7684;&#x9636;&#x6BB5;&#x3002;</p>
<a id="more"></a>
<h2 id="CMS&#x6536;&#x96C6;&#x5668;&#x7684;&#x8FC7;&#x7A0B;"><a href="#CMS&#x6536;&#x96C6;&#x5668;&#x7684;&#x8FC7;&#x7A0B;" class="headerlink" title="CMS&#x6536;&#x96C6;&#x5668;&#x7684;&#x8FC7;&#x7A0B;"></a>CMS&#x6536;&#x96C6;&#x5668;&#x7684;&#x8FC7;&#x7A0B;</h2><p>CMS&#x6536;&#x96C6;&#x5668;&#x7684;GC&#x5468;&#x671F;&#x7531;6&#x4E2A;&#x9636;&#x6BB5;&#x7EC4;&#x6210;&#x3002;&#x5176;&#x4E2D;4&#x4E2A;&#x9636;&#x6BB5;(&#x540D;&#x5B57;&#x4EE5;Concurrent&#x5F00;&#x59CB;&#x7684;)&#x4E0E;&#x5B9E;&#x9645;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x662F;&#x5E76;&#x53D1;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x800C;&#x5176;&#x4ED6;2&#x4E2A;&#x9636;&#x6BB5;&#x9700;&#x8981;&#x6682;&#x505C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EBF;&#x7A0B;&#x3002;</p>
<ol>
<li>&#x521D;&#x59CB;&#x6807;&#x8BB0;:&#x4E3A;&#x4E86;&#x6536;&#x96C6;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5BF9;&#x8C61;&#x5F15;&#x7528;&#x9700;&#x8981;&#x6682;&#x505C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EBF;&#x7A0B;&#xFF0C;&#x8BE5;&#x9636;&#x6BB5;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EBF;&#x7A0B;&#x518D;&#x6B21;&#x542F;&#x52A8;&#x3002;</li>
<li>&#x5E76;&#x53D1;&#x6807;&#x8BB0;:&#x4ECE;&#x7B2C;&#x4E00;&#x9636;&#x6BB5;&#x6536;&#x96C6;&#x5230;&#x7684;&#x5BF9;&#x8C61;&#x5F15;&#x7528;&#x5F00;&#x59CB;&#xFF0C;&#x904D;&#x5386;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x7684;&#x5BF9;&#x8C61;&#x5F15;&#x7528;&#x3002;</li>
<li>&#x5E76;&#x53D1;&#x9884;&#x6E05;&#x7406;:&#x6539;&#x53D8;&#x5F53;&#x8FD0;&#x884C;&#x7B2C;&#x4E8C;&#x9636;&#x6BB5;&#x65F6;&#xFF0C;&#x7531;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EBF;&#x7A0B;&#x4EA7;&#x751F;&#x7684;&#x5BF9;&#x8C61;&#x5F15;&#x7528;&#xFF0C;&#x4EE5;&#x66F4;&#x65B0;&#x7B2C;&#x4E8C;&#x9636;&#x6BB5;&#x7684;&#x7ED3;&#x679C;&#x3002;</li>
<li>&#x91CD;&#x6807;&#x8BB0;:&#x7531;&#x4E8E;&#x7B2C;&#x4E09;&#x9636;&#x6BB5;&#x662F;&#x5E76;&#x53D1;&#x7684;&#xFF0C;&#x5BF9;&#x8C61;&#x5F15;&#x7528;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x751F;&#x8FDB;&#x4E00;&#x6B65;&#x6539;&#x53D8;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EBF;&#x7A0B;&#x4F1A;&#x518D;&#x4E00;&#x6B21;&#x88AB;&#x6682;&#x505C;&#x4EE5;&#x66F4;&#x65B0;&#x8FD9;&#x4E9B;&#x53D8;&#x5316;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x8FDB;&#x884C;&#x5B9E;&#x9645;&#x7684;&#x6E05;&#x7406;&#x4E4B;&#x524D;&#x786E;&#x4FDD;&#x4E00;&#x4E2A;&#x6B63;&#x786E;&#x7684;&#x5BF9;&#x8C61;&#x5F15;&#x7528;&#x89C6;&#x56FE;&#x3002;&#x8FD9;&#x4E00;&#x9636;&#x6BB5;&#x5341;&#x5206;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x5FC5;&#x987B;&#x907F;&#x514D;&#x6536;&#x96C6;&#x5230;&#x4ECD;&#x88AB;&#x5F15;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x3002;</li>
<li>&#x5E76;&#x53D1;&#x6E05;&#x7406;:&#x6240;&#x6709;&#x4E0D;&#x518D;&#x88AB;&#x5E94;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x5C06;&#x4ECE;&#x5806;&#x91CC;&#x6E05;&#x9664;&#x6389;&#x3002;</li>
<li>&#x5E76;&#x53D1;&#x91CD;&#x7F6E;:&#x6536;&#x96C6;&#x5668;&#x505A;&#x4E00;&#x4E9B;&#x6536;&#x5C3E;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x4EE5;&#x4FBF;&#x4E0B;&#x4E00;&#x6B21;GC&#x5468;&#x671F;&#x80FD;&#x6709;&#x4E00;&#x4E2A;&#x5E72;&#x51C0;&#x7684;&#x72B6;&#x6001;&#x3002;</li>
</ol>
<p>&#x4E00;&#x4E2A;&#x5E38;&#x89C1;&#x7684;&#x8BEF;&#x89E3;&#x662F;,CMS&#x6536;&#x96C6;&#x5668;&#x8FD0;&#x884C;&#x662F;&#x5B8C;&#x5168;&#x4E0E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5E76;&#x53D1;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x770B;&#x5230;&#xFF0C;&#x4E8B;&#x5B9E;&#x5E76;&#x975E;&#x5982;&#x6B64;&#xFF0C;&#x5373;&#x4F7F;&#x201C;stop-the-world&#x201D;&#x9636;&#x6BB5;&#x76F8;&#x5BF9;&#x4E8E;&#x5E76;&#x53D1;&#x9636;&#x6BB5;&#x7684;&#x65F6;&#x95F4;&#x5F88;&#x77ED;&#x3002;</p>
<p>&#x5E94;&#x8BE5;&#x6307;&#x51FA;&#xFF0C;&#x5C3D;&#x7BA1;CMS&#x6536;&#x96C6;&#x5668;&#x4E3A;&#x8001;&#x5E74;&#x4EE3;&#x5783;&#x573E;&#x56DE;&#x6536;&#x63D0;&#x4F9B;&#x4E86;&#x51E0;&#x4E4E;&#x5B8C;&#x5168;&#x5E76;&#x53D1;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x7136;&#x800C;&#x5E74;&#x8F7B;&#x4EE3;&#x4ECD;&#x7136;&#x901A;&#x8FC7;&#x201C;stop-the-world&#x201D;&#x65B9;&#x6CD5;&#x6765;&#x8FDB;&#x884C;&#x6536;&#x96C6;&#x3002;&#x5BF9;&#x4E8E;&#x4EA4;&#x4E92;&#x5F0F;&#x5E94;&#x7528;&#xFF0C;&#x505C;&#x987F;&#x4E5F;&#x662F;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#xFF0C;&#x80CC;&#x540E;&#x7684;&#x539F;&#x7406;&#x662F;&#x5E74;&#x8F7B;&#x5E26;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x65F6;&#x95F4;&#x901A;&#x5E38;&#x662F;&#x76F8;&#x5F53;&#x77ED;&#x7684;&#x3002;</p>
<h2 id="&#x6311;&#x6218;"><a href="#&#x6311;&#x6218;" class="headerlink" title="&#x6311;&#x6218;"></a>&#x6311;&#x6218;</h2><p>&#x5F53;&#x6211;&#x4EEC;&#x5728;&#x771F;&#x5B9E;&#x7684;&#x5E94;&#x7528;&#x4E2D;&#x4F7F;&#x7528;CMS&#x6536;&#x96C6;&#x5668;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x9762;&#x4E34;&#x4E24;&#x4E2A;&#x4E3B;&#x8981;&#x7684;&#x6311;&#x6218;&#xFF0C;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x8C03;&#x4F18;:</p>
<ol>
<li>&#x5806;&#x788E;&#x7247;</li>
<li>&#x5BF9;&#x8C61;&#x5206;&#x914D;&#x7387;&#x9AD8;</li>
</ol>
<p>&#x5806;&#x788E;&#x7247;&#x662F;&#x6709;&#x53EF;&#x80FD;&#x7684;&#xFF0C;&#x4E0D;&#x50CF;&#x541E;&#x5410;&#x91CF;&#x6536;&#x96C6;&#x5668;&#xFF0C;CMS&#x6536;&#x96C6;&#x5668;&#x5E76;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x788E;&#x7247;&#x6574;&#x7406;&#x7684;&#x673A;&#x5236;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6709;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x8FD9;&#x6837;&#x7684;&#x60C5;&#x5F62;&#xFF0C;&#x5373;&#x4F7F;&#x603B;&#x7684;&#x5806;&#x5927;&#x5C0F;&#x8FDC;&#x6CA1;&#x6709;&#x8017;&#x5C3D;&#xFF0C;&#x4F46;&#x5374;&#x4E0D;&#x80FD;&#x5206;&#x914D;&#x5BF9;&#x8C61;&#x2014;&#x2014;&#x4EC5;&#x4EC5;&#x662F;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x8FDE;&#x7EED;&#x7684;&#x7A7A;&#x95F4;&#x5B8C;&#x5168;&#x5BB9;&#x7EB3;&#x5BF9;&#x8C61;&#x3002;&#x5F53;&#x8FD9;&#x79CD;&#x4E8B;&#x53D1;&#x751F;&#x540E;&#xFF0C;&#x5E76;&#x53D1;&#x7B97;&#x6CD5;&#x4E0D;&#x4F1A;&#x5E2E;&#x4E0A;&#x4EFB;&#x4F55;&#x5FD9;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x4E07;&#x4E0D;&#x5F97;&#x5DF2;JVM&#x4F1A;&#x89E6;&#x53D1;Full GC&#x3002;&#x56DE;&#x60F3;&#x4E00;&#x4E0B;&#xFF0C;Full GC &#x5C06;&#x8FD0;&#x884C;&#x541E;&#x5410;&#x91CF;&#x6536;&#x96C6;&#x5668;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x4ECE;&#x800C;&#x89E3;&#x51B3;&#x788E;&#x7247;&#x95EE;&#x9898;&#x2014;&#x2014;&#x4F46;&#x5374;&#x6682;&#x505C;&#x4E86;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EBF;&#x7A0B;&#x3002;&#x56E0;&#x6B64;&#x5C3D;&#x7BA1;CMS&#x6536;&#x96C6;&#x5668;&#x5E26;&#x6765;&#x5B8C;&#x5168;&#x7684;&#x5E76;&#x53D1;&#x6027;&#xFF0C;&#x4F46;&#x4ECD;&#x7136;&#x6709;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x957F;&#x65F6;&#x95F4;&#x7684;&#x201C;stop-the-world&#x201D;&#x7684;&#x98CE;&#x9669;&#x3002;&#x8FD9;&#x662F;&#x201C;&#x8BBE;&#x8BA1;&#x201D;&#xFF0C;&#x800C;&#x4E0D;&#x80FD;&#x907F;&#x514D;&#x7684;&#x2014;&#x2014;&#x6211;&#x4EEC;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x8C03;&#x4F18;&#x6536;&#x96C6;&#x5668;&#x6765;&#x5B83;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;&#x60F3;&#x8981;100%&#x4FDD;&#x8BC1;&#x907F;&#x514D;&#x201D;stop-the-world&#x201D;&#xFF0C;&#x5BF9;&#x4E8E;&#x4EA4;&#x4E92;&#x5F0F;&#x5E94;&#x7528;&#x662F;&#x6709;&#x95EE;&#x9898;&#x7684;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x4E2A;&#x6311;&#x6218;&#x5C31;&#x662F;&#x5E94;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x5206;&#x914D;&#x7387;&#x9AD8;&#x3002;&#x5982;&#x679C;&#x83B7;&#x53D6;&#x5BF9;&#x8C61;&#x5B9E;&#x4F8B;&#x7684;&#x9891;&#x7387;&#x9AD8;&#x4E8E;&#x6536;&#x96C6;&#x5668;&#x6E05;&#x9664;&#x5806;&#x91CC;&#x6B7B;&#x5BF9;&#x8C61;&#x7684;&#x9891;&#x7387;&#xFF0C;&#x5E76;&#x53D1;&#x7B97;&#x6CD5;&#x5C06;&#x518D;&#x6B21;&#x5931;&#x8D25;&#x3002;&#x4ECE;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x8BF4;&#xFF0C;&#x8001;&#x5E74;&#x4EE3;&#x5C06;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x53EF;&#x7528;&#x7A7A;&#x95F4;&#x6765;&#x5BB9;&#x7EB3;&#x4E00;&#x4E2A;&#x4ECE;&#x5E74;&#x8F7B;&#x4EE3;&#x63D0;&#x5347;&#x8FC7;&#x6765;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x5E76;&#x53D1;&#x6A21;&#x5F0F;&#x5931;&#x8D25;&#x201D;&#xFF0C;&#x5E76;&#x4E14;JVM&#x4F1A;&#x6267;&#x884C;&#x5806;&#x788E;&#x7247;&#x6574;&#x7406;:&#x89E6;&#x53D1;Full GC&#x3002;</p>
<p>&#x5F53;&#x8FD9;&#x4E9B;&#x60C5;&#x5F62;&#x4E4B;&#x4E00;&#x51FA;&#x73B0;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x65F6;(&#x7ECF;&#x5E38;&#x4F1A;&#x51FA;&#x73B0;&#x5728;&#x751F;&#x4EA7;&#x7CFB;&#x7EDF;&#x4E2D;)&#xFF0C;&#x7ECF;&#x5E38;&#x88AB;&#x8BC1;&#x5B9E;&#x662F;&#x8001;&#x5E74;&#x4EE3;&#x6709;&#x5927;&#x91CF;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x4E00;&#x4E2A;&#x53EF;&#x884C;&#x7684;&#x529E;&#x6CD5;&#x5C31;&#x662F;&#x589E;&#x52A0;&#x5E74;&#x8F7B;&#x4EE3;&#x7684;&#x5806;&#x5927;&#x5C0F;&#xFF0C;&#x4EE5;&#x9632;&#x6B62;&#x5E74;&#x8F7B;&#x4EE3;&#x77ED;&#x751F;&#x547D;&#x7684;&#x5BF9;&#x8C61;&#x63D0;&#x524D;&#x8FDB;&#x5165;&#x8001;&#x5E74;&#x4EE3;&#x3002;&#x53E6;&#x4E00;&#x4E2A;&#x529E;&#x6CD5;&#x5C31;&#x4F3C;&#x4E4E;&#x5229;&#x7528;&#x5206;&#x6790;&#x5668;&#xFF0C;&#x5FEB;&#x7167;&#x8FD0;&#x884C;&#x7CFB;&#x7EDF;&#x7684;&#x5806;&#x8F6C;&#x50A8;&#xFF0C;&#x5E76;&#x4E14;&#x5206;&#x6790;&#x8FC7;&#x5EA6;&#x7684;&#x5BF9;&#x8C61;&#x5206;&#x914D;&#xFF0C;&#x627E;&#x51FA;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#xFF0C;&#x6700;&#x7EC8;&#x51CF;&#x5C11;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x7684;&#x7533;&#x8BF7;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x6211;&#x770B;&#x770B;&#x5927;&#x591A;&#x6570;&#x4E0E;CMS&#x6536;&#x96C6;&#x5668;&#x8C03;&#x4F18;&#x76F8;&#x5173;&#x7684;JVM&#x6807;&#x5FD7;&#x53C2;&#x6570;&#x3002;</p>
<h2 id="XX-UseConcMarkSweepGC"><a href="#XX-UseConcMarkSweepGC" class="headerlink" title="-XX:+UseConcMarkSweepGC"></a>-XX:+UseConcMarkSweepGC</h2><p>&#x8BE5;&#x6807;&#x5FD7;&#x9996;&#x5148;&#x662F;&#x6FC0;&#x6D3B;CMS&#x6536;&#x96C6;&#x5668;&#x3002;&#x9ED8;&#x8BA4;HotSpot JVM&#x4F7F;&#x7528;&#x7684;&#x662F;&#x5E76;&#x884C;&#x6536;&#x96C6;&#x5668;&#x3002;</p>
<h2 id="XX-UseParNewGC"><a href="#XX-UseParNewGC" class="headerlink" title="-XX:UseParNewGC"></a>-XX:UseParNewGC</h2><p>&#x5F53;&#x4F7F;&#x7528;CMS&#x6536;&#x96C6;&#x5668;&#x65F6;&#xFF0C;&#x8BE5;&#x6807;&#x5FD7;&#x6FC0;&#x6D3B;&#x5E74;&#x8F7B;&#x4EE3;&#x4F7F;&#x7528;&#x591A;&#x7EBF;&#x7A0B;&#x5E76;&#x884C;&#x6267;&#x884C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x3002;&#x8FD9;&#x4EE4;&#x4EBA;&#x5F88;&#x60CA;&#x8BB6;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x7B80;&#x5355;&#x5728;&#x5E76;&#x884C;&#x6536;&#x96C6;&#x5668;&#x4E2D;&#x91CD;&#x7528;-XX:UserParNewGC&#x6807;&#x5FD7;&#xFF0C;&#x56E0;&#x4E3A;&#x6982;&#x5FF5;&#x4E0A;&#x5E74;&#x8F7B;&#x4EE3;&#x7528;&#x7684;&#x7B97;&#x6CD5;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5BF9;&#x4E8E;CMS&#x6536;&#x96C6;&#x5668;&#xFF0C;&#x5E74;&#x8F7B;&#x4EE3;GC&#x7B97;&#x6CD5;&#x548C;&#x8001;&#x5E74;&#x4EE3;GC&#x7B97;&#x6CD5;&#x662F;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x5E74;&#x8F7B;&#x4EE3;GC&#x6709;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x5E76;&#x4E14;&#x662F;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x6807;&#x5FD7;&#x3002;</p>
<p>&#x6CE8;&#x610F;&#x6700;&#x65B0;&#x7684;JVM&#x7248;&#x672C;&#xFF0C;&#x5F53;&#x4F7F;&#x7528;-XX:+UseConcMarkSweepGC&#x65F6;&#xFF0C;-XX:UseParNewGC&#x4F1A;&#x81EA;&#x52A8;&#x5F00;&#x542F;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x5E74;&#x8F7B;&#x4EE3;&#x7684;&#x5E76;&#x884C;GC&#x4E0D;&#x60F3;&#x5F00;&#x542F;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BBE;&#x7F6E;-XX:-UseParNewGC&#x6765;&#x5173;&#x6389;&#x3002;</p>
<h2 id="XX-CMSConcurrentMTEnabled"><a href="#XX-CMSConcurrentMTEnabled" class="headerlink" title="-XX:+CMSConcurrentMTEnabled"></a>-XX:+CMSConcurrentMTEnabled</h2><p>&#x5F53;&#x8BE5;&#x6807;&#x5FD7;&#x88AB;&#x542F;&#x7528;&#x65F6;&#xFF0C;&#x5E76;&#x53D1;&#x7684;CMS&#x9636;&#x6BB5;&#x5C06;&#x4EE5;&#x591A;&#x7EBF;&#x7A0B;&#x6267;&#x884C;(&#x56E0;&#x6B64;&#xFF0C;&#x591A;&#x4E2A;GC&#x7EBF;&#x7A0B;&#x4F1A;&#x4E0E;&#x6240;&#x6709;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EBF;&#x7A0B;&#x5E76;&#x884C;&#x5DE5;&#x4F5C;)&#x3002;&#x8BE5;&#x6807;&#x5FD7;&#x5DF2;&#x7ECF;&#x9ED8;&#x8BA4;&#x5F00;&#x542F;&#xFF0C;&#x5982;&#x679C;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x66F4;&#x597D;&#xFF0C;&#x8FD9;&#x53D6;&#x51B3;&#x4E8E;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x786C;&#x4EF6;&#xFF0C;&#x591A;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;-XX:-CMSConcurremntMTEnabled&#x7981;&#x7528;&#x3002;</p>
<h2 id="XX-ConcGCThreads"><a href="#XX-ConcGCThreads" class="headerlink" title="-XX:ConcGCThreads"></a>-XX:ConcGCThreads</h2><p>&#x6807;&#x5FD7;-XX:ConcGCThreads=<value>(&#x65E9;&#x671F;JVM&#x7248;&#x672C;&#x4E5F;&#x53EB;-XX:ParallelCMSThreads)&#x5B9A;&#x4E49;&#x5E76;&#x53D1;CMS&#x8FC7;&#x7A0B;&#x8FD0;&#x884C;&#x65F6;&#x7684;&#x7EBF;&#x7A0B;&#x6570;&#x3002;&#x6BD4;&#x5982;value=4&#x610F;&#x5473;&#x7740;CMS&#x5468;&#x671F;&#x7684;&#x6240;&#x6709;&#x9636;&#x6BB5;&#x90FD;&#x4EE5;4&#x4E2A;&#x7EBF;&#x7A0B;&#x6765;&#x6267;&#x884C;&#x3002;&#x5C3D;&#x7BA1;&#x66F4;&#x591A;&#x7684;&#x7EBF;&#x7A0B;&#x4F1A;&#x52A0;&#x5FEB;&#x5E76;&#x53D1;CMS&#x8FC7;&#x7A0B;&#xFF0C;&#x4F46;&#x5176;&#x4E5F;&#x4F1A;&#x5E26;&#x6765;&#x989D;&#x5916;&#x7684;&#x540C;&#x6B65;&#x5F00;&#x9500;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5BF9;&#x4E8E;&#x7279;&#x5B9A;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x5E94;&#x8BE5;&#x901A;&#x8FC7;&#x6D4B;&#x8BD5;&#x6765;&#x5224;&#x65AD;&#x589E;&#x52A0;CMS&#x7EBF;&#x7A0B;&#x6570;&#x662F;&#x5426;&#x771F;&#x7684;&#x80FD;&#x591F;&#x5E26;&#x6765;&#x6027;&#x80FD;&#x7684;&#x63D0;&#x5347;&#x3002;</value></p>
<p>&#x5982;&#x679C;&#x8FD8;&#x6807;&#x5FD7;&#x672A;&#x8BBE;&#x7F6E;&#xFF0C;JVM&#x4F1A;&#x6839;&#x636E;&#x5E76;&#x884C;&#x6536;&#x96C6;&#x5668;&#x4E2D;&#x7684;-XX:ParallelGCThreads&#x53C2;&#x6570;&#x7684;&#x503C;&#x6765;&#x8BA1;&#x7B97;&#x51FA;&#x9ED8;&#x8BA4;&#x7684;&#x5E76;&#x884C;CMS&#x7EBF;&#x7A0B;&#x6570;&#x3002;&#x8BE5;&#x516C;&#x5F0F;&#x662F;ConcGCThreads = (ParallelGCThreads + 3)/4&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5BF9;&#x4E8E;CMS&#x6536;&#x96C6;&#x5668;&#xFF0C; -XX:ParallelGCThreads&#x6807;&#x5FD7;&#x4E0D;&#x4EC5;&#x5F71;&#x54CD;&#x201C;stop-the-world&#x201D;&#x5783;&#x573E;&#x6536;&#x96C6;&#x9636;&#x6BB5;&#xFF0C;&#x8FD8;&#x5F71;&#x54CD;&#x5E76;&#x53D1;&#x9636;&#x6BB5;&#x3002;</p>
<p>&#x603B;&#x4E4B;&#xFF0C;&#x6709;&#x4E0D;&#x5C11;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x914D;&#x7F6E;CMS&#x6536;&#x96C6;&#x5668;&#x7684;&#x591A;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x3002;&#x6B63;&#x662F;&#x7531;&#x4E8E;&#x8FD9;&#x4E2A;&#x539F;&#x56E0;,&#x5EFA;&#x8BAE;&#x7B2C;&#x4E00;&#x6B21;&#x8FD0;&#x884C;CMS&#x6536;&#x96C6;&#x5668;&#x65F6;&#x4F7F;&#x7528;&#x5176;&#x9ED8;&#x8BA4;&#x8BBE;&#x7F6E;, &#x7136;&#x540E;&#x5982;&#x679C;&#x9700;&#x8981;&#x8C03;&#x4F18;&#x518D;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#x3002;&#x53EA;&#x6709;&#x5728;&#x751F;&#x4EA7;&#x7CFB;&#x7EDF;&#x4E2D;&#x6D4B;&#x91CF;(&#x6216;&#x7C7B;&#x751F;&#x4EA7;&#x6D4B;&#x8BD5;&#x7CFB;&#x7EDF;)&#x53D1;&#x73B0;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6682;&#x505C;&#x65F6;&#x95F4;&#x7684;&#x76EE;&#x6807;&#x6CA1;&#x6709;&#x8FBE;&#x5230; , &#x5C31;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8FD9;&#x4E9B;&#x6807;&#x5FD7;&#x5E94;&#x8BE5;&#x8FDB;&#x884C;GC&#x8C03;&#x4F18;&#x3002;</p>
<h2 id="XX-CMSInitiatingOccupancyFraction"><a href="#XX-CMSInitiatingOccupancyFraction" class="headerlink" title="-XX:CMSInitiatingOccupancyFraction"></a>-XX:CMSInitiatingOccupancyFraction</h2><p>&#x5F53;&#x5806;&#x6EE1;&#x4E4B;&#x540E;&#xFF0C;&#x5E76;&#x884C;&#x6536;&#x96C6;&#x5668;&#x4FBF;&#x5F00;&#x59CB;&#x8FDB;&#x884C;&#x5783;&#x573E;&#x6536;&#x96C6;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x5F53;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x7A7A;&#x95F4;&#x6765;&#x5BB9;&#x7EB3;&#x65B0;&#x5206;&#x914D;&#x6216;&#x63D0;&#x5347;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x5BF9;&#x4E8E;CMS&#x6536;&#x96C6;&#x5668;&#xFF0C;&#x957F;&#x65F6;&#x95F4;&#x7B49;&#x5F85;&#x662F;&#x4E0D;&#x53EF;&#x53D6;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x5E76;&#x53D1;&#x5783;&#x573E;&#x6536;&#x96C6;&#x671F;&#x95F4;&#x5E94;&#x7528;&#x6301;&#x7EED;&#x5728;&#x8FD0;&#x884C;(&#x5E76;&#x4E14;&#x5206;&#x914D;&#x5BF9;&#x8C61;)&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4E3A;&#x4E86;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#x5B8C;&#x5185;&#x5B58;&#x4E4B;&#x524D;&#x5B8C;&#x6210;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5468;&#x671F;&#xFF0C;CMS&#x6536;&#x96C6;&#x5668;&#x8981;&#x6BD4;&#x5E76;&#x884C;&#x6536;&#x96C6;&#x5668;&#x66F4;&#x5148;&#x542F;&#x52A8;&#x3002;</p>
<p>&#x56E0;&#x4E3A;&#x4E0D;&#x540C;&#x7684;&#x5E94;&#x7528;&#x4F1A;&#x6709;&#x4E0D;&#x540C;&#x5BF9;&#x8C61;&#x5206;&#x914D;&#x6A21;&#x5F0F;&#xFF0C;JVM&#x4F1A;&#x6536;&#x96C6;&#x5B9E;&#x9645;&#x7684;&#x5BF9;&#x8C61;&#x5206;&#x914D;(&#x548C;&#x91CA;&#x653E;)&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x4E14;&#x5206;&#x6790;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#xFF0C;&#x6765;&#x51B3;&#x5B9A;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x542F;&#x52A8;&#x4E00;&#x6B21;CMS&#x5783;&#x573E;&#x6536;&#x96C6;&#x5468;&#x671F;&#x3002;&#x4E3A;&#x4E86;&#x5F15;&#x5BFC;&#x8FD9;&#x4E00;&#x8FC7;&#x7A0B;&#xFF0C; JVM&#x4F1A;&#x5728;&#x4E00;&#x5F00;&#x59CB;&#x6267;&#x884C;CMS&#x5468;&#x671F;&#x524D;&#x4F5C;&#x4E00;&#x4E9B;&#x7EBF;&#x7D22;&#x67E5;&#x627E;&#x3002;&#x8BE5;&#x7EBF;&#x7D22;&#x7531; -XX:CMSInitiatingOccupancyFraction=<value>&#x6765;&#x8BBE;&#x7F6E;&#xFF0C;&#x8BE5;&#x503C;&#x4EE3;&#x8868;&#x8001;&#x5E74;&#x4EE3;&#x5806;&#x7A7A;&#x95F4;&#x7684;&#x4F7F;&#x7528;&#x7387;&#x3002;&#x6BD4;&#x5982;&#xFF0C;value=75&#x610F;&#x5473;&#x7740;&#x7B2C;&#x4E00;&#x6B21;CMS&#x5783;&#x573E;&#x6536;&#x96C6;&#x4F1A;&#x5728;&#x8001;&#x5E74;&#x4EE3;&#x88AB;&#x5360;&#x7528;75%&#x65F6;&#x88AB;&#x89E6;&#x53D1;&#x3002;&#x901A;&#x5E38;CMSInitiatingOccupancyFraction&#x7684;&#x9ED8;&#x8BA4;&#x503C;&#x4E3A;68(&#x4E4B;&#x524D;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#x7684;&#x7ECF;&#x5386;&#x6765;&#x51B3;&#x5B9A;&#x7684;)&#x3002;</value></p>
<h2 id="XX-UseCMSInitiatingOccupancyOnly"><a href="#XX-UseCMSInitiatingOccupancyOnly" class="headerlink" title="-XX:+UseCMSInitiatingOccupancyOnly"></a>-XX:+UseCMSInitiatingOccupancyOnly</h2><p>&#x6211;&#x4EEC;&#x7528;-XX+UseCMSInitiatingOccupancyOnly&#x6807;&#x5FD7;&#x6765;&#x547D;&#x4EE4;JVM&#x4E0D;&#x57FA;&#x4E8E;&#x8FD0;&#x884C;&#x65F6;&#x6536;&#x96C6;&#x7684;&#x6570;&#x636E;&#x6765;&#x542F;&#x52A8;CMS&#x5783;&#x573E;&#x6536;&#x96C6;&#x5468;&#x671F;&#x3002;&#x800C;&#x662F;&#xFF0C;&#x5F53;&#x8BE5;&#x6807;&#x5FD7;&#x88AB;&#x5F00;&#x542F;&#x65F6;&#xFF0C;JVM&#x901A;&#x8FC7;CMSInitiatingOccupancyFraction&#x7684;&#x503C;&#x8FDB;&#x884C;&#x6BCF;&#x4E00;&#x6B21;CMS&#x6536;&#x96C6;&#xFF0C;&#x800C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x7B2C;&#x4E00;&#x6B21;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8BF7;&#x8BB0;&#x4F4F;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;JVM&#x6BD4;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x80FD;&#x4F5C;&#x51FA;&#x66F4;&#x597D;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x51B3;&#x7B56;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x53EA;&#x6709;&#x5F53;&#x6211;&#x4EEC;&#x5145;&#x8DB3;&#x7684;&#x7406;&#x7531;(&#x6BD4;&#x5982;&#x6D4B;&#x8BD5;)&#x5E76;&#x4E14;&#x5BF9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EA7;&#x751F;&#x7684;&#x5BF9;&#x8C61;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x6709;&#x6DF1;&#x523B;&#x7684;&#x8BA4;&#x77E5;&#x65F6;&#xFF0C;&#x624D;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x8BE5;&#x6807;&#x5FD7;&#x3002;</p>
<h2 id="XX-CMSClassUnloadingEnabled"><a href="#XX-CMSClassUnloadingEnabled" class="headerlink" title="-XX:+CMSClassUnloadingEnabled"></a>-XX:+CMSClassUnloadingEnabled</h2><p>&#x76F8;&#x5BF9;&#x4E8E;&#x5E76;&#x884C;&#x6536;&#x96C6;&#x5668;&#xFF0C;CMS&#x6536;&#x96C6;&#x5668;&#x9ED8;&#x8BA4;&#x4E0D;&#x4F1A;&#x5BF9;&#x6C38;&#x4E45;&#x4EE3;&#x8FDB;&#x884C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x3002;&#x5982;&#x679C;&#x5E0C;&#x671B;&#x5BF9;&#x6C38;&#x4E45;&#x4EE3;&#x8FDB;&#x884C;&#x5783;&#x573E;&#x56DE;&#x6536;&#xFF0C;&#x53EF;&#x7528;&#x8BBE;&#x7F6E;&#x6807;&#x5FD7;-XX:+CMSClassUnloadingEnabled&#x3002;&#x5728;&#x65E9;&#x671F;JVM&#x7248;&#x672C;&#x4E2D;&#xFF0C;&#x8981;&#x6C42;&#x8BBE;&#x7F6E;&#x989D;&#x5916;&#x7684;&#x6807;&#x5FD7;-XX:+CMSPermGenSweepingEnabled&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x5373;&#x4F7F;&#x6CA1;&#x6709;&#x8BBE;&#x7F6E;&#x8FD9;&#x4E2A;&#x6807;&#x5FD7;&#xFF0C;&#x4E00;&#x65E6;&#x6C38;&#x4E45;&#x4EE3;&#x8017;&#x5C3D;&#x7A7A;&#x95F4;&#x4E5F;&#x4F1A;&#x5C1D;&#x8BD5;&#x8FDB;&#x884C;&#x5783;&#x573E;&#x56DE;&#x6536;&#xFF0C;&#x4F46;&#x662F;&#x6536;&#x96C6;&#x4E0D;&#x4F1A;&#x662F;&#x5E76;&#x884C;&#x7684;&#xFF0C;&#x800C;&#x518D;&#x4E00;&#x6B21;&#x8FDB;&#x884C;Full GC&#x3002;</p>
<h2 id="XX-CMSIncrementalMode"><a href="#XX-CMSIncrementalMode" class="headerlink" title="-XX:+CMSIncrementalMode"></a>-XX:+CMSIncrementalMode</h2><p>&#x8BE5;&#x6807;&#x5FD7;&#x5C06;&#x5F00;&#x542F;CMS&#x6536;&#x96C6;&#x5668;&#x7684;&#x589E;&#x91CF;&#x6A21;&#x5F0F;&#x3002;&#x589E;&#x91CF;&#x6A21;&#x5F0F;&#x7ECF;&#x5E38;&#x6682;&#x505C;CMS&#x8FC7;&#x7A0B;&#xFF0C;&#x4EE5;&#x4FBF;&#x5BF9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EBF;&#x7A0B;&#x4F5C;&#x51FA;&#x5B8C;&#x5168;&#x7684;&#x8BA9;&#x6B65;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6536;&#x96C6;&#x5668;&#x5C06;&#x82B1;&#x66F4;&#x957F;&#x7684;&#x65F6;&#x95F4;&#x5B8C;&#x6210;&#x6574;&#x4E2A;&#x6536;&#x96C6;&#x5468;&#x671F;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x53EA;&#x6709;&#x901A;&#x8FC7;&#x6D4B;&#x8BD5;&#x540E;&#x53D1;&#x73B0;&#x6B63;&#x5E38;CMS&#x5468;&#x671F;&#x5BF9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EBF;&#x7A0B;&#x5E72;&#x6270;&#x592A;&#x5927;&#x65F6;&#xFF0C;&#x624D;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x589E;&#x91CF;&#x6A21;&#x5F0F;&#x3002;&#x7531;&#x4E8E;&#x73B0;&#x4EE3;&#x670D;&#x52A1;&#x5668;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x5904;&#x7406;&#x5668;&#x6765;&#x9002;&#x5E94;&#x5E76;&#x53D1;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x53D1;&#x751F;&#x5F97;&#x5F88;&#x5C11;&#x3002;</p>
<h2 id="XX-ExplicitGCInvokesConcurrent-and-XX-ExplicitGCInvokesConcurrentAndUnloadsClasses"><a href="#XX-ExplicitGCInvokesConcurrent-and-XX-ExplicitGCInvokesConcurrentAndUnloadsClasses" class="headerlink" title="-XX:+ExplicitGCInvokesConcurrent and -XX:+ExplicitGCInvokesConcurrentAndUnloadsClasses"></a>-XX:+ExplicitGCInvokesConcurrent and -XX:+ExplicitGCInvokesConcurrentAndUnloadsClasses</h2><p>&#x5982;&#x4ECA;,&#x88AB;&#x5E7F;&#x6CDB;&#x63A5;&#x53D7;&#x7684;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x662F;&#x907F;&#x514D;&#x663E;&#x5F0F;&#x5730;&#x8C03;&#x7528;GC(&#x6240;&#x8C13;&#x7684;&#x201C;&#x7CFB;&#x7EDF;GC&#x201D;)&#xFF0C;&#x5373;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x8C03;&#x7528;system.gc()&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x4E2A;&#x5EFA;&#x8BAE;&#x662F;&#x4E0D;&#x7BA1;&#x4F7F;&#x7528;&#x7684;GC&#x7B97;&#x6CD5;&#x7684;&#xFF0C;&#x503C;&#x5F97;&#x4E00;&#x63D0;&#x7684;&#x662F;&#xFF0C;&#x5F53;&#x4F7F;&#x7528;CMS&#x6536;&#x96C6;&#x5668;&#x65F6;&#xFF0C;&#x7CFB;&#x7EDF;GC&#x5C06;&#x662F;&#x4E00;&#x4EF6;&#x5F88;&#x4E0D;&#x5E78;&#x7684;&#x4E8B;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x9ED8;&#x8BA4;&#x4F1A;&#x89E6;&#x53D1;&#x4E00;&#x6B21;Full GC&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x6709;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x53EF;&#x4EE5;&#x6539;&#x53D8;&#x9ED8;&#x8BA4;&#x8BBE;&#x7F6E;&#x3002;&#x6807;&#x5FD7;-XX:+ExplicitGCInvokesConcurrent&#x547D;&#x4EE4;JVM&#x65E0;&#x8BBA;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x8C03;&#x7528;&#x7CFB;&#x7EDF;GC&#xFF0C;&#x90FD;&#x6267;&#x884C;CMS GC&#xFF0C;&#x800C;&#x4E0D;&#x662F;Full GC&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x6807;&#x5FD7;-XX:+ExplicitGCInvokesConcurrentAndUnloadsClasses&#x4FDD;&#x8BC1;&#x5F53;&#x6709;&#x7CFB;&#x7EDF;GC&#x8C03;&#x7528;&#x65F6;&#xFF0C;&#x6C38;&#x4E45;&#x4EE3;&#x4E5F;&#x88AB;&#x5305;&#x62EC;&#x8FDB;CMS&#x5783;&#x573E;&#x56DE;&#x6536;&#x7684;&#x8303;&#x56F4;&#x5185;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x6807;&#x5FD7;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x51FA;&#x73B0;&#x610F;&#x6599;&#x4E4B;&#x5916;&#x7684;&#x201D;stop-the-world&#x201D;&#x7684;&#x7CFB;&#x7EDF;GC&#x3002;</p>
<h2 id="XX-DisableExplicitGC"><a href="#XX-DisableExplicitGC" class="headerlink" title="-XX:+DisableExplicitGC"></a>-XX:+DisableExplicitGC</h2><p>&#x7136;&#x800C;&#x5728;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x4E0A;&#x2026;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x63D0;&#x5230;- XX:+ DisableExplicitGC&#x6807;&#x5FD7;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x8BE5;&#x6807;&#x5FD7;&#x5C06;&#x544A;&#x8BC9;JVM&#x5B8C;&#x5168;&#x5FFD;&#x7565;&#x7CFB;&#x7EDF;&#x7684;GC&#x8C03;&#x7528;(&#x4E0D;&#x7BA1;&#x4F7F;&#x7528;&#x7684;&#x6536;&#x96C6;&#x5668;&#x662F;&#x4EC0;&#x4E48;&#x7C7B;&#x578B;)&#x3002;&#x5BF9;&#x4E8E;&#x6211;&#x800C;&#x8A00;&#xFF0C;&#x8BE5;&#x6807;&#x5FD7;&#x5C5E;&#x4E8E;&#x9ED8;&#x8BA4;&#x7684;&#x6807;&#x5FD7;&#x96C6;&#x5408;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x5B89;&#x5168;&#x5730;&#x5B9A;&#x4E49;&#x5728;&#x6BCF;&#x4E2A;JVM&#x4E0A;&#x8FD0;&#x884C;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x8FDB;&#x4E00;&#x6B65;&#x601D;&#x8003;&#x3002;</p>

      
    </div>
    <footer>
      
        
  
  <div class="categories">
    <a href="/categories/tec/">TEC-技术</a>
  </div>

        
  
  <div class="tags">
    <a href="/tags/JVM/"># JVM</a>
  </div>


        <br/>
<pre><code><b>*版权声明</b>:如未特殊标注说明，本文为原创,如需转载请注明来自,本文链接为<b><a href="/2016/10/08/useful-jvm-flags-part-7-cms-collector/" target="_blank" title="JVM实用参数（七）CMS收集器">DeleiGuo:JVM实用参数（七）CMS收集器</a></b>.</code></pre>

        
      
      <div class="clearfix"></div>
    </footer>
  </div>
</article>


</div></div>
    <aside id="sidebar" class="alignright">
  <div class="search">
  <form action="//google.com/search" method="get" accept-charset="utf-8">
    <input type="search" name="q" results="0" placeholder="搜索">
    <input type="hidden" name="q" value="site:www.deleiguo.com">
  </form>
</div>

  
<div class="widget tag">
  <h3 class="title">分类</h3>
  <ul class="entry">
  
    <li><a href="/categories/pri/">PRI-文章</a><small>2</small></li>
  
    <li><a href="/categories/tec/">TEC-技术</a><small>13</small></li>
  
  </ul>
</div>


  
<div class="widget tag">
  <h3 class="title">标签</h3>
  <ul class="entry">
  
    <li><a href="/tags/DeleiGuo/">DeleiGuo</a><small>1</small></li>
  
    <li><a href="/tags/JVM/">JVM</a><small>9</small></li>
  
    <li><a href="/tags/Java/">Java</a><small>2</small></li>
  
    <li><a href="/tags/Linux/">Linux</a><small>2</small></li>
  
    <li><a href="/tags/Team/">Team</a><small>1</small></li>
  
  </ul>
</div>


  <div class="widget tag">
    <h3 class="title">友情链接</h3>
    <ul class="entry">
        <ul>
            <li><i class="fa fa-link"></i>&nbsp;&nbsp;<a href="http://www.hollischuang.com" target="_blank">HollisChuang's Blog</a>
            </li>
            <li><i class="fa fa-link"></i>&nbsp;&nbsp;<a href="http://ifeve.com" target="_blank">并发编程网-ifeve.com</a>
            </li>
            <li><i class="fa fa-link"></i>&nbsp;&nbsp;<a href="http://www.kuqin.com" target="_blank">酷勤网</a>
            </li>
            <li><i class="fa fa-link"></i>&nbsp;&nbsp;<a href="http://grepcode.com" target="_blank">grepcode.com</a>
            </li>
            <li><i class="fa fa-link"></i>&nbsp;&nbsp;<a href="http://www.importnew.com" target="_blank">ImportNew</a>
            </li>
            <li><i class="fa fa-link"></i>&nbsp;&nbsp;<a href="http://www.jobbole.com" target="_blank">伯乐在线</a>
            </li>
            <li><i class="fa fa-link"></i>&nbsp;&nbsp;<a href="http://wiki.jikexueyuan.com" target="_blank">极客学院wiki</a>
            </li>
            <li><i class="fa fa-link"></i>&nbsp;&nbsp;<a href="http://hao.shejidaren.com/index.html" target="_blank">设计导航</a>
            </li>
        </ul>
    </ul>
</div>

</aside>
    <div class="clearfix"></div>
  </div>
  <footer id="footer">
      <div class="container">
          <h4 style="color:#333">
              I know no such things as genius,it is nothing but labor and diligence.<br/>
              -哪有什么天才之说，不过是勤奋
          </h4>
          <br/>
          <div class="text-center">
  
  &copy; 2016 DeleiGuo
  
  &nbsp;&nbsp;
  湘ICP备16012107号-1
  <br/>
  Powered by <a href="https://hexo.io" target="_blank">Hexo</a>. Theme by <a href="https://hexo.io/hexo-theme-light/" target="_blank">Light</a>.
</div>
<div class="dd-github-camo">
  <a href="https://github.com/delei"><img style="position: absolute; top: 0; right: 0; border: 0;" src="https://camo.githubusercontent.com/52760788cde945287fbb584134c4cbc2bc36f904/68747470733a2f2f73332e616d617a6f6e6177732e636f6d2f6769746875622f726962626f6e732f666f726b6d655f72696768745f77686974655f6666666666662e706e67" alt="Fork me on GitHub" data-canonical-src="https://s3.amazonaws.com/github/ribbons/forkme_right_white_ffffff.png"></a>
</div>
<div class="clearfix"></div>

      </div>
  </footer>
  <div id="totop" style="position:fixed;bottom:150px;right:50px;cursor: pointer;">
<a title="返回顶部"><img src="/images/scrollup.png"/></a>
</div>

<script src="/plugins/jquery.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>
<script src="/plugins/highlight/highlight.pack.js"></script>
<script src="/plugins/bootstrap-3.3.0/js/bootstrap.min.js"></script>
<script src="/js/totop.js"></script>
<script type="text/javascript">
(function($){
  hljs.initHighlightingOnLoad();
})(jQuery);
</script>


</body>
</html>
